<?php

$country = [
    "Московская область" => ["Москва","Зеленоград","Клин","Климовск"],
    "Ленинградская область" => ["Санкт-Петербург","Всеволжск","Павловск","Кронштадт"],
    "Рязанская область" => ["Рязань","Касимов","Сасово"]
];


foreach ($country as $key => $value){ 
    $ok = $key.": <br>";
    if(is_array($country[$key])){
        for($i=0;$i<count($country[$key]);$i++){
            if(mb_substr($value[$i],0, 1) == "К"){
                $ok .= $value[$i]." ";
            } 
        }
    }  
    $ok .= "<br>";
    echo $ok;
}

?>